tdata<-data.frame(
  x1=c( 7, 1,11,11, 7,11, 3, 1, 2,21, 1,11,10),
  x2=c(26,29,56,31,52,55,71,31,54,47,40,66,68),
  x3=c( 6,15, 8, 8, 6, 9,17,22,18, 4,23, 9, 8),
  x4=c(60,52,20,47,33,22, 6,44,22,26,34,12,12),
  Y =c(78.5,74.3,104.3,87.6,95.9,109.2,102.7,72.5,
       93.1,115.9,83.8,113.3,109.4)
)

#多元线性回归
tlm<-lm(Y~x1+x2+x3+x4,data=tdata)
summary(tlm) #各系数均不显著

#所以要做逐步回归
tstep <- step(object = tlm,direction = "both") #x3最小，去掉x3
tlm<-lm(Y~x1+x2+x4,data=tdata) #x2和x4不显著
summary(tlm)

#再做逐步回归
tstep <- step(tlm) #x4最小，去掉x4
tlm<-lm(Y~x1+x2,data=tdata)
summary(tlm) #各系数均显著

y=52.57735+1.46831*x1+0.66225*x2







